# ForwardIterator Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
TemperatureRatingTypeSet..::..ForwardIterator Method
TemperatureRatingTypeSet Class See Also
---
Retrieve a forward moving iterator to the set.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual TemperatureRatingTypeSetIterator ForwardIterator()
```

Visual Basic
---
```text
Public Overridable Function ForwardIterator As TemperatureRatingTypeSetIterator
```

Visual C++
---
```text
public:
virtual TemperatureRatingTypeSetIterator^ ForwardIterator()
```

# ### Return Value
Returns a forward moving iterator to the set.
# See Also
TemperatureRatingTypeSet Class
Autodesk.Revit.DB.Electrical Namespace